
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 7 to add, 0 to change, 4 to destroy.</code></pre>

* Create
  * module.et-database.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.et-database.terraform_data.trigger_password_reset
  * module.storage-account.time_rotating.rotate
* Replace
  * module.et-database.null_resource.set-user-permissions-additionaldbs[&#34;et1&#34;]
  * module.et-database.null_resource.set-user-permissions-additionaldbs[&#34;et3&#34;]
  * module.et-database.null_resource.set-user-permissions-additionaldbs[&#34;etapi&#34;]
  * module.storage-account.time_static.pim_expiry
* Move
  * module.application_insights.azurerm_monitor_activity_log_alert.main => module.application_insights.azurerm_monitor_activity_log_alert.main[0]
  * module.application_insights_main.azurerm_monitor_activity_log_alert.main => module.application_insights_main.azurerm_monitor_activity_log_alert.main[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.application_insights.azurerm_monitor_activity_log_alert.main has moved to module.application_insights.azurerm_monitor_activity_log_alert.main[0]
    resource "azurerm_monitor_activity_log_alert" "main" {
        id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-pet-prod/providers/Microsoft.Insights/activityLogAlerts/Application Insights daily cap reached - et-pet-prod"
        name                = "Application Insights daily cap reached - et-pet-prod"
        tags                = {
            "application"         = "et-pet"
            "builtFrom"           = "https://github.com/HMCTS/et-pet-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#pet"
            "environment"         = "production"
            "managedBy"           = "Employment Tribunals PET"
        }
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.application_insights_main.azurerm_monitor_activity_log_alert.main has moved to module.application_insights_main.azurerm_monitor_activity_log_alert.main[0]
    resource "azurerm_monitor_activity_log_alert" "main" {
        id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-pet-prod/providers/Microsoft.Insights/activityLogAlerts/Application Insights daily cap reached - et-pet-appinsights-prod"
        name                = "Application Insights daily cap reached - et-pet-appinsights-prod"
        tags                = {
            "application"         = "et-pet"
            "builtFrom"           = "https://github.com/HMCTS/et-pet-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#pet"
            "environment"         = "production"
            "managedBy"           = "Employment Tribunals PET"
        }
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.et-database.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      + id                  = (known after apply)
      + object_id           = "ef17f368-0aa5-43d5-9264-28080f83755e"
      + principal_name      = "DTS Platform Operations PostgreSQL Admin Access SC"
      + principal_type      = "Group"
      + resource_group_name = "et-pet-et-data-prod"
      + server_name         = "et-pet-et-prod"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.et-database.null_resource.set-user-permissions-additionaldbs["et1"] must be replaced
-/+ resource "null_resource" "set-user-permissions-additionaldbs" {
      ~ id       = "2205328311334223572" -> (known after apply)
      ~ triggers = { # forces replacement
          + "db_reader_schemas" = "public"
          ~ "script_hash"       = "dbe0102f3129d4463913d5e01177e806bc6954005bdd98f20c242658634a1bbc" -> "88abfc1a97fc27a8f4d01362525f3b65e85409d3a475ecc79b11ad09a019e469"
            # (3 unchanged elements hidden)
        }
    }

  # module.et-database.null_resource.set-user-permissions-additionaldbs["et3"] must be replaced
-/+ resource "null_resource" "set-user-permissions-additionaldbs" {
      ~ id       = "1667360203513411543" -> (known after apply)
      ~ triggers = { # forces replacement
          + "db_reader_schemas" = "public"
          ~ "script_hash"       = "dbe0102f3129d4463913d5e01177e806bc6954005bdd98f20c242658634a1bbc" -> "88abfc1a97fc27a8f4d01362525f3b65e85409d3a475ecc79b11ad09a019e469"
            # (3 unchanged elements hidden)
        }
    }

  # module.et-database.null_resource.set-user-permissions-additionaldbs["etapi"] must be replaced
-/+ resource "null_resource" "set-user-permissions-additionaldbs" {
      ~ id       = "1822907985591070800" -> (known after apply)
      ~ triggers = { # forces replacement
          + "db_reader_schemas" = "public"
          ~ "script_hash"       = "dbe0102f3129d4463913d5e01177e806bc6954005bdd98f20c242658634a1bbc" -> "88abfc1a97fc27a8f4d01362525f3b65e85409d3a475ecc79b11ad09a019e469"
            # (3 unchanged elements hidden)
        }
    }

  # module.et-database.terraform_data.trigger_password_reset will be created
  + resource "terraform_data" "trigger_password_reset" {
      + id     = (known after apply)
      + input  = ""
      + output = (known after apply)
    }

  # module.storage-account.time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.storage-account.time_static.pim_expiry must be replaced
-/+ resource "time_static" "pim_expiry" {
      ~ day     = 15 -> (known after apply)
      ~ hour    = 10 -> (known after apply)
      ~ id      = "2025-02-15T10:30:45Z" -> (known after apply)
      ~ minute  = 30 -> (known after apply)
      ~ month   = 2 -> (known after apply)
      ~ rfc3339 = "2025-02-15T10:30:45Z" -> (known after apply) # forces replacement
      ~ second  = 45 -> (known after apply)
      ~ unix    = 1739615445 -> (known after apply)
      ~ year    = 2025 -> (known after apply)
    }

Plan: 7 to add, 0 to change, 4 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.application_insights.azurerm_application_insights.this has changed
  ~ resource "azurerm_application_insights" "this" {
      ~ app_id                                = "et-pet-prod" -> "12a6bb6e-6c31-4e6d-913a-ec450c8ffd36"
        id                                    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-pet-prod/providers/Microsoft.Insights/components/et-pet-prod"
        name                                  = "et-pet-prod"
        tags                                  = {
            "application"         = "et-pet"
            "builtFrom"           = "https://github.com/HMCTS/et-pet-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#pet"
            "environment"         = "production"
            "managedBy"           = "Employment Tribunals PET"
        }
        # (15 unchanged attributes hidden)
    }

  # module.application_insights_main.azurerm_application_insights.this has changed
  ~ resource "azurerm_application_insights" "this" {
      ~ app_id                                = "et-pet-appinsights-prod" -> "b04f6642-b877-4794-adbe-495146cad0a4"
        id                                    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/et-pet-prod/providers/Microsoft.Insights/components/et-pet-appinsights-prod"
        name                                  = "et-pet-appinsights-prod"
        tags                                  = {
            "application"         = "et-pet"
            "builtFrom"           = "https://github.com/HMCTS/et-pet-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#pet"
            "environment"         = "production"
            "managedBy"           = "Employment Tribunals PET"
        }
        # (15 unchanged attributes hidden)
    }

  # module.storage-account.time_rotating.rotate has been deleted
  - resource "time_rotating" "rotate" {
        id               = "2024-02-21T10:30:45Z"
      - rotation_rfc3339 = "2025-02-15T10:30:45Z" -> null
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":13,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->